Revit 2027 API
BuiltInFailures.FamilyFailures.FailedToBecomeNonParametric Property
 Family failed to become non-parametric!
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FailedToBecomeNonParametric { get; }
Public Shared ReadOnly Property FailedToBecomeNonParametric As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FailedToBecomeNonParametric {
	FailureDefinitionId^ get ();
}
static member FailedToBecomeNonParametric : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace